In [1]:
import pandas as pd
import numpy as np

In [3]:
data = {
    'Car': ['Toyota', 'Ford', 'BMW', 'Honda', 'Tesla'],
    'Sales': [300,200,233, 900,890]
}
data

{'Car': ['Toyota', 'Ford', 'BMW', 'Honda', 'Tesla'],
 'Sales': [300, 200, 233, 900, 890]}

In [4]:
df = pd.DataFrame(data)
df

      Car  Sales
0  Toyota    300
1    Ford    200
2     BMW    233
3   Honda    900
4   Tesla    890

In [5]:
filtred_df = df[df['Sales'] > 300]
filtred_df

     Car  Sales
3  Honda    900
4  Tesla    890

In [9]:
filtred_df = filtred_df.reset_index(drop=True)
filtred_df

   index    Car  Sales
0      0  Honda    900
1      1  Tesla    890

In [26]:
# Multi-Level indexing
data = {
    'Car': ['Toyota', 'Ford', 'BMW', 'Honda', 'Tesla'],
    'Sales': [300,200,233, 900,890],
    'Quarter': ['Q1', 'Q2','Q1','Q1', 'Q2']
}
df = pd.DataFrame(data)
df

      Car  Sales Quarter
0  Toyota    300      Q1
1    Ford    200      Q2
2     BMW    233      Q1
3   Honda    900      Q1
4   Tesla    890      Q2

In [27]:
df = df.set_index(['Sales'])
df

          Car Quarter
Sales
300    Toyota      Q1
200      Ford      Q2
233       BMW      Q1
900     Honda      Q1
890     Tesla      Q2

In [28]:
# Reset with Sort values
sorted_data = df.sort_values(by='Sales', ascending=False)
sorted_data

          Car Quarter
Sales
900     Honda      Q1
890     Tesla      Q2
300    Toyota      Q1
233       BMW      Q1
200      Ford      Q2

### Count unique values

In [29]:
df

          Car Quarter
Sales
300    Toyota      Q1
200      Ford      Q2
233       BMW      Q1
900     Honda      Q1
890     Tesla      Q2

In [30]:
df['Car'].value_counts()

Car
Toyota    1
Ford      1
BMW       1
Honda     1
Tesla     1
Name: count, dtype: int64

In [31]:
df['Quarter'].unique()

array(['Q1', 'Q2'], dtype=object)

In [35]:
pd.DataFrame(df['Quarter'].unique()).head()

    0
0  Q1
1  Q2